[
  {
    "title": "If Cats Disappeared from the World",
    "image_url": "https://m.media-amazon.com/images/W/MEDIAX_849526-T3/images/I/71tQ71QaNML._SY522_.jpg",
    "author": "Genki Kawamura",
    "description": "Our narrator's days are numbered. Estranged from his family, living alone with only his cat Cabbage for company, he was unprepared for the doctor's diagnosis that he has only months to live. But before he can set about tackling his bucket list, the Devil appears with a special offer: in exchange for making one thing in the world disappear, he can have one extra day of life. And so begins a very bizarre week.",
    "subjects": ["fiction", "fantasy"]
  },
  {
    "title": "Atomic Habits",
    "image_url": "https://m.media-amazon.com/images/W/MEDIAX_849526-T3/images/I/51ZJ9RjiC0L._SY445_SX342_.jpg",
    "author": "James Clear",
    "description": "Atomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
    "subjects": ["self-help", "psychology"]
  },
  {
    "title": "The Heaven & Earth Grocery Store",
    "image_url": "https://encrypted-tbn1.gstatic.com/shopping?q=tbn:ANd9GcTMNZOTgoNIGJnV6-lylhWA8s4Aad_a3QgiQ7TUbuue11STJeN4p2x-gzpwv8zOxHMixr15SJNq-tc1GTDWxZrFYtjpWtMF9mqI3RrgkUucPUyL1MY5xmVq2w",
    "author": "James McBride",
    "description": "In 1972, when workers in Pottstown, Pennsylvania, were digging the foundations for a new development, the last thing they expected to find was a skeleton at the bottom of a well. Who the skeleton was and how it got there were two of the long-held secrets kept by the residents of Chicken Hill, the dilapidated neighbourhood where immigrant Jews and African Americans lived side by side and shared ambitions and sorrows.",
    "subjects": ["historical fiction", "mystery"]
  },
  {
    "title": "Another Book Title",
    "image_url": "https://example.com/another-image.jpg",
    "author": "Another Author",
    "description": "Description of another book.",
    "subjects": ["genre1", "genre2"]
  }
]